content/posts/javascript.md
+++
title = "JavaScript"
author = ["Jacob Chvatal"]
lastmod = 2020-10-18T20:21:36+02:00
slug = "javascript"
draft = false
+++

### Backlinks {#backlinks}

-   [Emacs]({{< relref "emacs" >}})

It's a terrible language, but given its status as the de-facto language of the web, it has an incredible ecosystem of tools developed to help out.


## Frameworks {#frameworks}

-   [Svelte ](https://github.com/sveltejs/svelte):: 'cybernetically enhanced' framework. [Why](https://github.com/feltcoop/why-svelte)
-   tools for seamless HTMl. The web should be more like this
-   [Hapi](https://github.com/hapijs/hapi)


## Libraries {#libraries}


### Functional Programming {#functional-programming}

[Fantasyland](https://github.com/fantasyland/fantasy-land)
: Specification for algebra in JavaScript
    -   **[Folktale](https://github.com/origamitower/folktale):** A corresponding standard library
    -   **[Staticland](https://github.com/fantasyland/static-land):** Fantasyland but without classes


## Tools {#tools}


### Typescript {#typescript}

[functional programing for ts](https://github.com/gcanti/fp-ts)


### Configuration {#configuration}

[Cosmiconfic](https://github.com/davidtheclark/cosmiconfig)
: Load configuration from anywhere

[Lerna](https://github.com/lerna/lerna)
: Manage JavaScript projects with multiple packages


### 3D {#3d}

<!--list-separator-->

-  BabylonJS

    [Create React App with Babylon and TypeScript](https://github.com/brianzinn/create-react-app-typescript-babylonjs)
    [React for Babylon](https://github.com/brianzinn/react-babylonjs)

<!--list-separator-->

-  MatterJS

    [Rigid body physics engine](https://github.com/liabru/matter-js)

    [Phaser](https://github.com/photonstorm/phaser)
    : 2d game framework

<!--list-separator-->

-  ThreeJS

    [flexbox for react-three-fiber](https://github.com/pmndrs/react-three-flex)


### UI Dev {#ui-dev}

<https://github.com/davidkpiano/flipping> :: flipping animation
<https://github.com/davidkpiano/xstate> :: state machines for the web

<!--list-separator-->

-  Storybook

    [the repo](https://github.com/storybookjs/storybook)
    [Material UI](https://github.com/react-theming/storybook-addon)


## Meta {#meta}

[Acorn](https://github.com/acornjs/acorn)
: js parser in js


### Babel {#babel}

The compiler for Javascript.
[Babel macros](https://github.com/jgierer12/awesome-babel-macros)


### EsLint {#eslint}

[Hardcore config](https://github.com/EvgenyOrekhov/eslint-config-hardcore)
[functional config](https://github.com/jonaskello/eslint-plugin-functional)

<https://github.com/apollographql/eslint-plugin-graphql>
: graphql support

<https://github.com/gajus/eslint-plugin-sql>
: sql support (kind of)

<https://github.com/azeemba/eslint-plugin-json>
: json support

<https://github.com/Bkucera/eslint-plugin-json-format>
: json autoformat

<https://github.com/mysticatea/eslint-plugin-node>
: nodejs rules

<https://github.com/BenoitZugmeyer/eslint-plugin-html>
: eslint for raw html

<https://github.com/dustinspecker/awesome-eslint>
: eslint resources


## Etc {#etc}

ImmutableJS: Immutable data structures
Ramda: Better JS functional programming
Typescript with these two is the de factor pure programming ecosystem

[Organice](https://github.com/200ok-ch/organice) :: Org mode without emacs
[automerge](https://github.com/automerge/automerge) :: a CRDT that allows concurrent modification
[Turbolinks](https://github.com/turbolinks/turbolinks) :: framework agnostic way of rendering views on server side and swapping in throuhg a socket
[tty.js](https://github.com/chjj/tty.js) :: terminal for the browser
[sanctuary](https://github.com/sanctuary-js/sanctuary) :: strict javascript functions composed functionally
<https://github.com/sindresorhus/speed-test> cli for speedtest.net
<https://github.com/calmm-js/kefir.atom> :: reactive state with lenses
<https://github.com/spcask/mdme> :: embed self rendering md content
<https://github.com/inkandswitch/cambria> bidirectional lenses
<https://github.com/padenot/ringbuf.js> ring buffers
<https://github.com/typeorm/typeorm/blob/master/README.md> super flexible js and ts orm that runs anywhere
phantomjs browser control
[excellent article on javascript generators](https://github.com/gajus/gajus.com-blog/blob/master/posts/the-definitive-guide-to-the-javascript-generators/index.md)
<https://ionicframework.com/react> apps everywhere with single react code base? seems too good to be true
